//----------------------------------------------------------------
// 这是一个计算圆的周长和面积的程序
// 时间：2025年9月26日
// 作者：ABYSS0124
//----------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
//----------------------------------------------------------------
int main()
{
    float r, c, s;
    const double PI=3.1415926535;   //定义一个常变量PI，不可修改
    printf("请输入圆的半径：");
    scanf("%f", &r);
    c = 2.0f * PI * r;
    s = PI * r * r;
    printf("该圆的周长为：%-15.2f\\\n", c);    //左对齐“-”，15字符（包括小数点）“15”，“.2”两位小数，“f”浮点数
    printf("该圆的面积为：%-15.2f\\\n", s);
    system("pause");    //暂停程序，以便查看结果
    return 0;
}

